const global_obj = {};
function hoge(o){
    global_obj.a = o.a;
    global_obj.b = o.b;
}
const obj = {
    a:1,
    b:2,
    c:3,
    aa: 10;
};
hoge(obj);

// ========================================
function hoge2(a, b, c, ... , z, aa){
    global_obj.a = o.a;
}
const a = 1;
const b = 2;
const c = 3;
const aa = 10;
hoge2(a, b, c, ... ,z, aa);

function piyo(...arr){
    // arr = [1, 2, 3, 4];
}
piyo(1, 2, 3, 4);

// 2進数と1bitと1byteとオーバフローバグ
//  10           2      16
//   0      0 0000       0
//   1      0 0001       1
//   2      0 0010       2
//   3      0 0011       3
//   4      0 0100       4
//   5      0 0101       5
//   6      0 0110       6
//   7      0 0111       7
//   8      0 1000       8
//   9      0 1001       9
//  10      0 1010       a
//  11      0 1011       b
//  12      0 1100       c
//  13      0 1101       d
//  14      0 1110       e
//  15      0 1111       f
//  16      1 0000      10
// 1Byte = 8Bit =  1111 1111 = 255 + 1 = 1 0000 0000 = 256 ? = 0  オーバーフロー

111111 = -1
111110 = -2
111101 = -3
111100 = -4
100000 = -128

11 = 0000 1011
10 = 0000 1010
9 = 0000 1001
8 = 0000 1000
7 = 0000 0111
6 = 0000 0110
5 = 0000 0101
3 = 0000 0011
-3 = 1111 1101
2 = 0000 0010
-2 = 1111 1110
1 = 0000 0001
-1 = 1111 1111

bit 数字を反転させて + 1させると値が切り替わる
bitシフト 1をずらす
1桁目が0の場合は偶数。1の場合は奇数と判断できる。

// 2Byte = 16Bit = 1111 1111 1111 1111 = 65535
//                 FFFF
//====================================================================



// OFF OFF 00
// ON  OFF 10
// OFF ON  01
// ON  ON  11
// 
// 
// 

let flag = 0;    // = 0000 0000
flag = 1;        // = 0000 0001
flag += 2;       // = 0000 0001 + 0000 0010 = 0000 0011

//====================================================================
// 0000 0000
// |||| ||||
// |||| |||+--- 道具入れ替えフラグ
// |||| ||+---- ビューネイ撃破フラグ
// |||| |+----- フォルネウス撃破フラグ
// |||| +------ アウナス撃破フラグ

const 攻撃力 = {};
// メモリ
// 0        1         2        3
// 00000001 00000000 00000000 00000000 00000000 00000000 00000000
//  0 |  6       | 次に書き換えるアドレス
//  1 |      0   | 敵キャラ撃破数
//  2 |  1Byte   |
//  3 |  1Byte   | flag
//  4 |  11      | 攻撃力
//  5 |  1Byte   | 魔力
//  6 |  1Byte   | エンディング呼び出しフラグ
//  7 |  1Byte   |
//  8 |  1Byte   |
//  9 |  1Byte   | キャラクター X軸
// 10 |  1Byte   | キャラクター Y軸
// 11 |  1Byte   |
// 12 |  1Byte   | フィールド/道具順, 戦闘中/PP
// 13 |  1Byte   | フィールド/キャラ座標, 戦闘/敵HP
// 14 |  1Byte   |
// 15 |  1Byte   | フィールド/道具入れ替え場所の選択位置, 
// 16 |  1Byte   |
// 17 |  1Byte   |
// 18 |  1Byte   |
// 19 |  1Byte   |
// 20 |  1Byte   |
// 21 |  1Byte   |
// 22 |  1Byte   |
// 23 |  1Byte   |
// 24 |  1Byte   |
// 25 |  1Byte   |
// 26 |  1Byte   |
// 27 |  1Byte   |
// 28 |  1Byte   |
// 29 |  1Byte   |
// 30 |  1Byte   |
// 31 |  1Byte   |
// 32 |  1Byte   |
// 33 |  1Byte   |
// 34 |  1Byte   |
// 35 |  1Byte   |
// 36 |  1Byte   |
// 37 |  1Byte   |
// 38 |  1Byte   |
// 39 |  1Byte   |
// 40 |  1Byte   |
// 41 |  1Byte   |
// 42 |  1Byte   |
// 43 |  1Byte   |
// 44 |  1Byte   |
// 45 |  1Byte   |
// 46 |  1Byte   |
// 47 |  1Byte   |
// 48 |  1Byte   |
// 49 |  1Byte   |

50   51   52 | 53  54  55 | 56 57
0    0    2  | 1   0   4  | 2  50

0 次の１バイトの値のアドレスをその次の1バイトの値にする
1 次の1バイトの値のアドレスにその次の1バイトの値を足す
2 次の1バイトの値のアドレスにジャンプする
